---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.CutsWall
source: html/4e831a66-a4ed-299d-7950-cec29c33b625.htm
---
# Autodesk.Revit.DB.WallSweepInfo.CutsWall Property

Indicates if you want the sweep to cut geometry out of the host wall.

## Syntax (C#)
```csharp
public bool CutsWall { get; set; }
```

## Remarks
When a sweep is offset and embedded in the wall, it cuts the geometry from the wall.